thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
When the DR register is written to, the entry in the transmit FIFO that is pointed to by the write pointer is written to. Data values are removed from the transmit FIFO one value at a time by the transmit logic. Each data value is loaded into the transmit serial shifter, then serially shifted out onto the SSITx pin at the programmed bit rate.

When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits. Received data less than 16 bits is automatically right-justified in the receive buffer.

When the SSI is programmed for MICROWIRE frame format, the default size for transmit data is eight bits (the most significant byte is ignored). The receive data size is controlled by the programmer. The transmit FIFO and the receive FIFO are not cleared even when the SSE bit in the SSICR1 register is cleared, allowing the software to fill the transmit FIFO before enabling the SSI.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[15:0] SSI receive/transmit data register (R/W)
Reset value: 0xXXXX
A read operation reads the receive FIFO. A write operation writes the transmit FIFO.
Software must right-justify data when the SSI is programmed
for a data size that is less than 16 bits. Unused bits at the top
are ignored by the transmit logic. The receive logic automatically right-justified the data.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>The SR register contains bits that indicate the FIFO fill status and the SSI busy status.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:5] Reserved, read unpredictable, should be written as 0.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>BSY</name>
              <description>[4:4] SSI busy bit (RO)
Reset value: 0x0
0: SSI is idle.
1: SSI is currently transmitting and/or receiving a frame or the
transmit FIFO is not empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RFF</name>
              <description>[3:3] SSI receive FIFO full (RO)
Reset value: 0x0
0: Receive FIFO is not full.
1: Receive FIFO is full.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RNE</name>
              <description>[2:2] SSI receive FIFO not empty (RO)
Reset value: 0x0
0: Receive FIFO is empty.
1: Receive FIFO is not empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TNF</name>
              <description>[1:1] SSI transmit FIFO not full (RO)
Reset value: 0x1
0: Transmit FIFO is full.
1: Transmit FIFO is not full.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TFE</name>
              <description>[0:0] SSI transmit FIFO empty (RO)
Reset value: 0x1
0: Transmit FIFO is not empty.
1: Transmit FIFO is empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CPSR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>The CPSR register specifies the division factor which is used to derive the SSIClk from the system clock. The clock is further divided by a value from 1 to 256, which is 1 + SCR. SCR is programmed in the SSICR0 register. The frequency of the SSIClk is defined by:
SSIClk = SysClk / (CPSDVSR x (1 + SCR))
The value programmed into this register must be an even number between 2 and 254. The least-significant bit of the programmed number is hard-coded to zero. If an odd number is written to this register, data read back from this register has the least-significant bit as zero.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:8] Reserved, read unpredictable, should be written as 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CPSDVSR</name>
              <description>[7:0] SSI clock prescale divisor (R/W)
Reset value: 0x0
This value must be an even number from 2 to 254, depending on the frequency of SSICLK. The LSB always returns zero on reads.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IM</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>The IM register is the interrupt mask set or clear register. It is a read/write register and all bits are cleared on reset.

On a read, this register gives the current value of the mask on the corresponding interrupt. Setting a bit sets the mask, preventing the interrupt from being signaled to the interrupt controller. Clearing a bit clears the corresponding mask, enabling the interrupt to be sent to the interrupt controller.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:4] Reserved, read as zero, do not modify.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TXIM</name>
              <description>[3:3] SSI transmit FIFO interrupt mask (R/W)
Reset value: 0x0
0: TX FIFO half empty or condition interrupt is masked.
1: TX FIFO half empty or less condition interrupt is not masked.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXIM</name>
              <description>[2:2] SSI receive FIFO interrupt mask (R/W)
Reset value: 0x0
0: RX FIFO half empty or condition interrupt is masked.
1: RX FIFO half empty or less condition interrupt is not masked.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTIM</name>
              <description>[1:1] SSI receive time-out interrupt mask (R/W)
Reset value: 0x0
0: RX FIFO time-out interrupt is masked.
1: RX FIFO time-out interrupt is not masked</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORIM</name>
              <description>[0:0] SSI receive overrun interrupt mask (R/W)
Reset value: 0x0
0: RX FIFO Overrun interrupt is masked.
1: RX FIFO Overrun interrupt is not masked</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RIS</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>The RIS register is the raw interrupt status register. On a read, this register gives the current raw status value of the corresponding interrupt before masking. A write has no effect.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved11</name>
              <description>[15:4] Reserved, read as zero, do not modify.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TXRIS</name>
              <description>[3:3] SSI SSITXINTR raw state (RO)
Reset value: 0x1
Gives the raw interrupt state (before masking) of SSITXINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXRIS</name>
              <description>[2:2] SSI SSIRXINTR raw state (RO)
Reset value: 0x0
Gives the raw interrupt state (before masking) of SSIRXINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTRIS</name>
              <description>[1:1] SSI SSIRTINTR raw state (RO)
Reset value: 0x0
Gives the raw interrupt state (before masking) of SSIRTINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORRIS</name>
              <description>[0:0] SSI SSIRORINTR raw state (RO)
Reset value: 0x0
Gives the raw interrupt state (before masking) of SSIRORINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>MIS</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>The MIS register is the masked interrupt status register. On a read, this register gives the current masked status value of the corresponding interrupt. A write has no effect.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:4] Reserved, read as zero, do not modify.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TXMIS</name>
              <description>[3:3] SSI SSITXINTR masked state (RO)
Reset value: 0x0
Gives the interrupt state (after masking) of SSITXINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXMIS</name>
              <description>[2:2] SSI SSIRXINTR masked state (RO)
Reset value: 0x0
Gives the interrupt state (after masking) of SSIRXINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTMIS</name>
              <description>[1:1] SSI SSIRTINTR masked state (RO)
Reset value: 0x0
Gives the interrupt state (after masking) of SSIRTINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORMIS</name>
              <description>[0:0] SSI SSIRORINTR masked state (RO)
Reset value: 0x0
Gives the interrupt state (after masking) of SSIRORINTR</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>The ICR register is the interrupt clear register. On a write of 1, the corresponding interrupt is cleared. A write of 0 has no effect.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Reserved</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:2] Reserved, read as zero, do not modify.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTIC</name>
              <description>[1:1] SSI receive time-out interrupt clear (W1C)
Reset value: 0x0
0: No effect on interrupt
1: Clears interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORIC</name>
              <description>[0:0] SSI receive overrun interrupt clear (W1C)
Reset value: 0x0
0: No effect on interrupt
1: Clears interrupt</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>The DMACTL register is the uDMA control register.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:2] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>[1:1] Transmit DMA enable
0: uDMA for the transmit FIFO is disabled.
1: uDMA for the transmit FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>[0:0] Receive DMA enable
0: uDMA for the receive FIFO is disabled.
1: uDMA for the receive FIFO is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CC</name>
          <addressOffset>0xfc8</addressOffset>
          <size>32</size>
          <description>SSI clock configuration
The CC register controls the baud clock and system clocks sources for the SSI module.
Note: If the PIOSC is used for the SSI baud clock, the system clock frequency must be at least 16 MHz in run mode.</description>
          <fields>
            <field>
              <name>Reserved29</name>
              <description>[31:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CS</name>
              <description>[2:0] SSI baud and system clock source
The following bits determine the clock source that generates the baud and system clocks for the SSI.
bit0 (PIOSC): 
       1: The SSI baud clock is determined by the IO DIV setting in the system controller.
       0: The SSI baud clock is determined by the SYS DIV setting in the system controller.
bit1: Unused
bit2: (DSEN) Only meaningful when the system is in deep sleep mode. This bit is a don't care when not in sleep mode. 
       1: The SSI system clock is running on the same clock as the baud clock, as per PIOSC setting above.
       0: The SSI system clock is determined by the SYS DIV setting in the system controller.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
