thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
        <register>
          <name>MIS</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>UART masked interrupt status
The MIS register is the masked interrupt status register. On a read, this register gives the current masked status value of the corresponding interrupt. A write has no effect.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LME5MIS</name>
              <description>[15:15] LIN mode edge 5 masked interrupt status
1: An unmasked interrupt was signaled due to the 5th falling edge of the LIN sync field.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the LME5IC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>LME1MIS</name>
              <description>[14:14] LIN mode edge 1 masked interrupt status
1: An unmasked interrupt was signaled due to the 1st falling edge of the LIN sync field.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the LME1IC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>LMSBMIS</name>
              <description>[13:13] LIN mode sync break masked interrupt status
1: An unmasked interrupt was signaled due to the receipt of a LIN sync break.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the LMSBIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>NINEBITMIS</name>
              <description>[12:12] 9-bit mode masked interrupt status
1: An unmasked interrupt was signaled due to a receive address match.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the 9BITIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[11:11] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>OEMIS</name>
              <description>[10:10] UART overrun error masked interrupt status
1: An unmasked interrupt was signaled due to an overrun error.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the OEIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>BEMIS</name>
              <description>[9:9] UART break error masked interrupt status
1: An unmasked interrupt was signaled due to a break error.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the BEIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PEMIS</name>
              <description>[8:8] UART parity error masked interrupt status
1: An unmasked interrupt was signaled due to a parity error.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the PEIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FEMIS</name>
              <description>[7:7] UART framing error masked interrupt status
1: An unmasked interrupt was signaled due to a framing error.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the FEIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RTMIS</name>
              <description>[6:6] UART receive time-out masked interrupt status
1: An unmasked interrupt was signaled due to a receive time out.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the RTIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TXMIS</name>
              <description>[5:5] UART transmit masked interrupt status
1: An unmasked interrupt was signaled due to passing through the specified transmit FIFO level (if the EOT bit is clear) or due to the transmission of the last data bit (if the EOT bit is set).
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the TXIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RXMIS</name>
              <description>[4:4] UART receive masked interrupt status
1: An unmasked interrupt was signaled due to passing through the specified receive FIFO level.
0: An interrupt has not occurred or is masked.
This bit is cleared by writing 1 to the RXIC bit in the UARTICR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved4</name>
              <description>[3:0] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>UART interrupt clear
The ICR register is the interrupt clear register. On a write of 1, the corresponding interrupt (both raw interrupt and masked interrupt, if enabled) is cleared. A write of 0 has no effect.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LME5IC</name>
              <description>[15:15] LIN mode edge 5 interrupt clear
Writing 1 to this bit clears the LME5RIS bit in the UARTRIS register and the LME5MIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>LME1IC</name>
              <description>[14:14] LIN mode edge 1 interrupt clear
Writing 1 to this bit clears the LME1RIS bit in the UARTRIS register and the LME1MIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>LMSBIC</name>
              <description>[13:13] LIN mode sync break interrupt clear
Writing 1 to this bit clears the LMSBRIS bit in the UARTRIS register and the LMSBMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>NINEBITIC</name>
              <description>[12:12] 9-bit mode interrupt clear
Writing 1 to this bit clears the 9BITRIS bit in the UARTRIS register and the 9BITMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[11:11] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>OEIC</name>
              <description>[10:10] Overrun error interrupt clear
Writing 1 to this bit clears the OERIS bit in the UARTRIS register and the OEMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>BEIC</name>
              <description>[9:9] Break error interrupt clear
Writing 1 to this bit clears the BERIS bit in the UARTRIS register and the BEMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PEIC</name>
              <description>[8:8] Parity error interrupt clear
Writing 1 to this bit clears the PERIS bit in the UARTRIS register and the PEMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FEIC</name>
              <description>[7:7] Framing error interrupt clear
Writing 1 to this bit clears the FERIS bit in the UARTRIS register and the FEMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RTIC</name>
              <description>[6:6] Receive time-out interrupt clear
Writing 1 to this bit clears the RTRIS bit in the UARTRIS register and the RTMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TXIC</name>
              <description>[5:5] Transmit interrupt clear
Writing 1 to this bit clears the TXRIS bit in the UARTRIS register and the TXMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RXIC</name>
              <description>[4:4] Receive interrupt clear
Writing 1 to this bit clears the RXRIS bit in the UARTRIS register and the RXMIS bit in the UARTMIS register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved4</name>
              <description>[3:0] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DMACTL</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>UART DMA control
The DMACTL register is the DMA control register.</description>
          <fields>
            <field>
              <name>Reserved29</name>
              <description>[31:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>DMAERR</name>
              <description>[2:2] DMA on error
1: uDMA receive requests are automatically disabled when a receive error occurs.
0: uDMA receive requests are unaffected when a receive error occurs.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TXDMAE</name>
              <description>[1:1] Transmit DMA enable
1: uDMA for the transmit FIFO is enabled.
0: uDMA for the transmit FIFO is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RXDMAE</name>
              <description>[0:0] Receive DMA enable
1: uDMA for the receive FIFO is enabled.
0: uDMA for the receive FIFO is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LCTL</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>UART LIN control
The LCTL register is the configures the operation of the UART when in LIN mode.</description>
          <fields>
            <field>
              <name>Reserved26</name>
              <description>[31:6] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>BLEN</name>
              <description>[5:4] Sync break length
0x3: Sync break length is 16T bits
0x2: Sync break length is 15T bits
0x1: Sync break length is 14T bits
0x0: Sync break length is 13T bits (default)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[3:1] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MASTER</name>
              <description>[0:0] LIN master enable
1: The UART operates as a LIN master.
0: The UART operates as a LIN slave.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LSS</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>LIN snap shot
The LSS register captures the free-running timer value when either the sync edge 1 or the sync edge 5 is detected in LIN mode.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TSS</name>
              <description>[15:0] Timer snap shot
This field contains the value of the free-running timer when either the sync edge 5 or the sync edge 1 was detected.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>LTIM</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>UART LIN timer
The LTIM register contains the current timer value for the free-running timer that is used to calculate the baud rate when in LIN slave mode. The value in this register is used along with the value in the UART LIN snap shot (LSS) register to adjust the baud rate to match that of the master.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TIMER</name>
              <description>[15:0] Timer value
This field contains the value of the free-running timer.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NINEBITADDR</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>UART 9-bit self address
The NINEBITADDR register is used to write the specific address that should be matched with the receiving byte when the 9-bit address mask (NINEBITAMASK) is set to 0xFF. This register is used in conjunction with NINEBITAMASK to form a match for address-byte received.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>NINEBITEN</name>
              <description>[15:15] Enable 9-bit mode
1: 9-bit mode is enabled.
0: 9-bit mode is disabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <description>[14:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADDR</name>
              <description>[7:0] Self address for 9-bit mode
This field contains the address that should be matched when UART9BITAMASK is 0xFF.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>NINEBITAMASK</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>UART 9-bit self address mask
The NINEBITAMASK register is used to enable the address mask for 9-bit mode. The lower address bits are masked to create a range of address to be matched with the received address byte.</description>
          <fields>
            <field>
              <name>Reserved16</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RANGE</name>
              <description>[15:8] Self address range for 9-bit mode
Writing to the RANGE field does not have any effect; reading it reflects the ANDed output of the ADDR field in the UART9BITADDR register and the MASK field.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>MASK</name>
              <description>[7:0] Self Address Mask for 9-Bit Mode
This field contains the address mask that creates a range of addresses that should be matched.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PP</name>
          <addressOffset>0xfc0</addressOffset>
          <size>32</size>
          <description>UART peripheral properties
The PP register provides information regarding the properties of the UART module.</description>
          <fields>
            <field>
              <name>Reserved30</name>
              <description>[31:2] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>NB</name>
              <description>[1:1] 9-bit support
1: The UART module provides support for the transmission of 9-bit data for RS-485 support.
0: The UART module does not provide support for the transmission of 9-bit data for RS-485 support.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SC</name>
              <description>[0:0] Smart card support
1: The UART module provides smart card support.
0: The UART module does not provide smart card support.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
