thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPTIMER0</name>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>CFG</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>GPTM configuration
This register configures the global operation of the GPTM. The value written to this register determines whether the GPTM is in 32-bit mode (concatenated timers) or in 16-bit mode (individual, split timers).</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>GPTMCFG</name>
              <description>[2:0] GPTM configuration
The GPTMCFG values are defined as follows:
0x0: 32-bit timer configuration.
0x1: 32-bit real-time clock
0x2: Reserved
0x3: Reserved
0x4: 16-bit timer configuration.
The function is controlled by bits [1:0] of GPTMTAMR and GPTMTBMR.
0x5-0x7: Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAMR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>GPTM Timer A mode
This register configures the GPTM based on the configuration selected in the CFG register.
This register controls the modes for Timer A when it is used individually. When Timer A and Timer B are concatenated, this register controls the modes for both Timer A and Timer B, and the contents of TBMR are ignored.</description>
          <fields>
            <field>
              <name>Reserved12</name>
              <description>[31:12] Reserved</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TAPLO</name>
              <description>[11:11] Legacy PWM operation
0: Legacy operation
1: CCP is set to 1 on time-out.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>TAMRSU</name>
              <description>[10:10] Timer A match register update mode
0: Update GPTMAMATCHR and GPTMAPR if used on the next cycle.
1: Update GPTMAMATCHR and GPTMAPR if used on the next
time-out. If the timer is disabled (TAEN is clear) when this bit is set, GPTMTAMATCHR and GPTMTAPR are updated when the timer is
enabled. If the timer is stalled (TASTALL is set), GPTMTAMATCHR and GPTMTAPR are updated according to the configuration of this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TAPWMIE</name>
              <description>[9:9] GPTM Timer A PWM interrupt enable
This bit enables interrupts in PWM mode on rising, falling, or both edges of the CCP output.
0: Interrupt is disabled.
1: Interrupt is enabled.
This bit is valid only in PWM mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TAILD</name>
              <description>[8:8] GPTM Timer A PWM interval load write
0: Update the GPTMTAR register with the value in the GPTMTAILR register on the next cycle. If the prescaler is used, update the GPTMTAPS register with the value in the GPTMTAPR register on the next cycle.
1: Update the GPTMTAR register with the value in the GPTMTAILR register on the next cycle. If the prescaler is used, update the GPTMTAPS register with the value in the GPTMTAPR register on the next time-out.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TASNAPS</name>
              <description>[7:7] GPTM Timer A snap-shot mode
0: Snap-shot mode is disabled.
1: If Timer A is configured in periodic mode, the actual free-running value of Timer A is loaded at the time-out event into the GPTM Timer A (GPTMTAR) register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TAWOT</name>
              <description>[6:6] GPTM Timer A wait-on-trigger
0: Timer A begins counting as soon as it is enabled.
1: If Timer A is enabled (TAEN is set in the GPTMCTL register), Timer A does not begin counting until it receives a trigger from the Timer in the previous position in the daisy-chain. This bit must be clear for GP Timer module 0, Timer A.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TAMIE</name>
              <description>[5:5] GPTM Timer A match interrupt enable
0: The match interrupt is disabled.
1: An interrupt is generated when the match value in the GPTMTAMATCHR register is reached in the one-shot and periodic
modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TACDIR</name>
              <description>[4:4] GPTM Timer A count direction
0: The timer counts down.
1: The timer counts up. When counting up, the timer starts from a value of 0x0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TAAMS</name>
              <description>[3:3] GPTM Timer A alternate mode
0: Capture mode is enabled.
1: PWM mode is enabled.
Note: To enable PWM mode, the TACM bit must be cleared and the TAMR field must be configured to 0x2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>TACMR</name>
              <description>[2:2] GPTM Timer A capture mode
0: Edge-count mode
1: Edge-time mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TAMR</name>
              <description>[1:0] GPTM Timer A mode
0x0: Reserved
0x1: One-shot mode
0x2: Periodic mode
0x3: Capture mode
The timer mode is based on the timer configuration defined by bits [2:0] in the GPTMCFG register.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBMR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>GPTM Timer B mode
This register configures the GPTM based on the configuration selected in the CFG register.
This register controls the modes for Timer B when it is used individually. When Timer A and Timer B are concatenated, this register is ignored and TBMR controls the modes for both Timer A and Timer B.</description>
          <fields>
            <field>
              <name>Reserved12</name>
              <description>[31:12] Reserved</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBPLO</name>
              <description>[11:11] Legacy PWM operation
0: Legacy operation
1: CCP is set to 1 on time-out.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>TBMRSU</name>
              <description>[10:10] Timer B match register update mode
0: Update the GPTMBMATCHR and the GPTMBPR, if used on the next cycle.
1: Update the GPTMBMATCHR and the GPTMBPR, if used on the next time-out. If the timer is disabled (TAEN is clear) when this bit is set, GPTMTBMATCHR and GPTMTBPR are updated when the timer is enabled. If the timer is stalled (TBSTALL is set), GPTMTBMATCHR and GPTMTBPR are updated according to the configuration of this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TBPWMIE</name>
              <description>[9:9] GPTM Timer B PWM interrupt enable
This bit enables interrupts in PWM mode on rising, falling, or both edges of the CCP output.
0: Interrupt is disabled.
1: Interrupt is enabled.
This bit is valid only in PWM mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBILD</name>
              <description>[8:8] GPTM Timer B PWM interval load write
0: Update the GPTMTBR register with the value in the GPTMTBILR register on the next cycle. If the prescaler is used, update the GPTMTBPS register with the value in the GPTMTBPR register on the next cycle.
1: Update the GPTMTBR register with the value in the GPTMTBILR register on the next cycle. If the prescaler is used, update the GPTMTBPS register with the value in the GPTMTBPR register on the next time-out.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TBSNAPS</name>
              <description>[7:7] GPTM Timer B snap-shot mode
0: Snap-shot mode is disabled.
1: If Timer B is configured in the periodic mode, the actual free-running value of Timer A is loaded into the GPTM Timer B (GPTMTBR) register at the time-out event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TBWOT</name>
              <description>[6:6] GPTM Timer B wait-on-trigger
0: Timer B begins counting as soon as it is enabled.
1: If Timer B is enabled (TBEN is set in the GPTMCTL register), Timer B does not begin counting until it receives a trigger from the timer in the previous position in the daisy-chain.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TBMIE</name>
              <description>[5:5] GPTM Timer B match interrupt enable
0: The match interrupt is disabled.
1: An interrupt is generated when the match value in the GPTMTBMATCHR register is reached in the one-shot and periodic
modes.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TBCDIR</name>
              <description>[4:4] GPTM Timer B count direction
0: The timer counts down.
1: The timer counts up. When counting up, the timer starts from a value of 0x0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TBAMS</name>
              <description>[3:3] GPTM Timer B alternate mode
0: Capture mode is enabled.
1: PWM mode is enabled.
Note: To enable PWM mode, the TBCM bit must be cleared and the
TBMR field must be configured to 0x2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>TBCMR</name>
              <description>[2:2] GPTM Timer B capture mode
0: Edge-count mode
1: Edge-time mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TBMR</name>
              <description>[1:0] GPTM Timer B mode
0x0: Reserved
0x1: One-shot timer mode
0x2: Periodic timer mode
0x3: Capture mode
The timer mode is based on the timer configuration defined by bits [2:0] in the GPTMCFG register.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>GPTM control
This register is used alongside the CFG and TnMR registers to fine-tune the timer configuration, and to enable other features such as timer stall.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:15] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>TBPWML</name>
              <description>[14:14] GPTM Timer B PWM output level
0: Output is unaffected.
1: Output is inverted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>TBOTE</name>
              <description>[13:13] GPTM Timer B output trigger enable
0: The ADC trigger of output Timer B is disabled.
1: The ADC trigger of output Timer B is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>Reserved13</name>
              <description>[12:12] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBEVENT</name>
              <description>[11:10] GPTM Timer B event mode
0x0: Positive edge
0x1: Negative edge
0x2: Reserved
0x3: Both edges</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>TBSTALL</name>
              <description>[9:9] GPTM Timer B stall enable
0: Timer B continues counting while the processor is halted by the debugger.
1: Timer B freezes counting while the processor is halted by the debugger.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBEN</name>
              <description>[8:8] GPTM Timer B enable
0: Timer B is disabled.
1: Timer B is enabled and begins counting or the capture logic is enabled based on the GPTMCFG register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TAPWML</name>
              <description>[6:6] GPTM Timer A PWM output level
0: Output is unaffected.
1: Output is inverted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>TAOTE</name>
              <description>[5:5] GPTM Timer A output trigger enable
0: The ADC trigger of output Timer A is disabled.
1: The ADC trigger of output Timer A is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>Reserved4</name>
              <description>[4:4] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TAEVENT</name>
              <description>[3:2] GPTM Timer A event mode
0x0: Positive edge
0x1: Negative edge
0x2: Reserved
0x3: Both edges</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TASTALL</name>
              <description>[1:1] GPTM Timer A stall enable
0: Timer A continues counting while the processor is halted by the debugger.
1: Timer A freezes counting while the processor is halted by the debugger.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TAEN</name>
              <description>[0:0] GPTM Timer A enable
0: Timer A is disabled.
1: Timer A is enabled and begins counting or the capture logic is enabled based on the GPTMCFG register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SYNC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>GPTM synchronize
Note: This register is implemented on GPTM 0 base address only.
This register does however, allow software to synchronize a number of timers.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SYNC3</name>
              <description>[7:6] Synchronize GPTM3
0x0: GPTM3 is not affected.
0x1: A time-out event for Timer A of GPTM3 is triggered.
0x2: A time-out event for Timer B of GPTM3 is triggered.
0x3: A time-out event for Timer A and Timer B of GPTM3 is triggered.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SYNC2</name>
              <description>[5:4] Synchronize GPTM2
0x0: GPTM2 is not affected.
0x1: A time-out event for Timer A of GPTM2 is triggered.
0x2: A time-out event for Timer B of GPTM2 is triggered.
0x3: A time-out event for Timer A and Timer B of GPTM2 is triggered.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SYNC1</name>
              <description>[3:2] Synchronize GPTM1
0x0: GPTM1 is not affected.
0x1: A time-out event for Timer A of GPTM1 is triggered.
0x2: A time-out event for Timer B of GPTM1 is triggered.
0x3: A time-out event for Timer A and Timer B of GPTM1 is triggered.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SYNC0</name>
              <description>[1:0] Synchronize GPTM0
0x0: GPTM0 is not affected.
0x1: A time-out event for Timer A of GPTM0 is triggered.
0x2: A time-out event for Timer B of GPTM0 is triggered.
0x3: A time-out event for Timer A and Timer B of GPTM0 is triggered.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
