thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
        <register>
          <name>TAR</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>GPTM Timer A
This register shows the current value of the Timer A counter.
When a GPTM is configured to one of the 32-bit modes, TAR appears as a 32-bit register (the upper 16-bits correspond to the contents of the GPTM Timer B (TBR) register). In the16-bit Input edge count, input edge time, and PWM modes, bits [15:0] contain the value of the counter and bits 23:16 contain the value of the prescaler, which is the upper 8 bits of the count. Bits [31:24] always read as 0. To read the value of the prescaler in 16-bit, one-shot and periodic modes, read bits [23:16] in the TAV register.</description>
          <fields>
            <field>
              <name>TAR</name>
              <description>[31:0] GPTM Timer A register</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBR</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>GPTM Timer B
This register shows the current value of the Timer B counter.
When a GPTM is configured to one of the 32-bit modes, the contents of bits [15:0] in this register are loaded into the upper 16 bits of the TAR register. Reads from this register return the current value of Timer B. In a 16-bit mode, bits 15:0 contain the value of the counter and bits [23:16] contain the value of the prescaler in Input edge count, input edge time, and PWM modes, which is the upper 8 bits of the count. Bits [31:24] always read as 0. To read the value of the prescaler in 16-bit, one-shot and periodic modes, read bits [23:16] in the TBV register.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TBR</name>
              <description>[15:0] GPTM Timer B register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAV</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>GPTM Timer A value
When read, this register shows the current, free-running value of Timer A in all modes. Software can use this value to determine the time elapsed between an interrupt and the ISR entry when using the snapshot feature with the periodic operating mode. When written, the value written into this register is loaded into the TAR register on the next clock cycle.
When a GPTM is configured to one of the 32-bit modes, TAV appears as a 32-bit register (the upper 16-bits correspond to the contents of the GPTM Timer B Value (TBV) register). In a 16-bit mode, bits [15:0] contain the value of the counter and bits [23:16] contain the current, free-running value of the prescaler, which is the upper 8 bits of the count in input edge count, input edge time, PWM and one-shot or periodic up count modes. In one-shot or periodic down count modes, the prescaler stored in [23:16] is a true prescaler, meaning bits [23:16] count down before decrementing the value in bits [15:0]. The prescaler its [31:24] always read as 0.</description>
          <fields>
            <field>
              <name>TAV</name>
              <description>[31:0] GPTM Timer A register</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBV</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>GPTM Timer B value
When read, this register shows the current, free-running value of Timer B in all modes. Software can use this value to determine the time elapsed between an interrupt and the ISR entry. When written, the value written into this register is loaded into the TBR register on the next clock cycle.
When a GPTM is configured to one of the 32-bit modes, the contents of bits 15:0 in this register are loaded into the upper 16 bits of the TAV register. Reads from this register return the current free-running value of Timer B. In a 16-bit mode, bits [15:0] contain the value of the counter and bits [23:16] contain the current, free-running value of the prescaler, which is the upper 8 bits of the count in input edge count, input edge time, PWM and one-shot or periodic up count modes. In one-shot or periodic down count modes, the prescaler stored in [23:16] is a true prescaler, meaning bits [23:16] count down before decrementing the value in bits [15:0]. The prescaler its [31:24] always read as 0.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:24] GPTM Timer B register</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PRE</name>
              <description>[23:16] GPTM Timer B prescale register (16-bit mode)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TBV</name>
              <description>[15:0] GPTM Timer B register</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPS</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>GPTM Timer A prescale snapshot
For the 32-bit wide GPTM, this register shows the current value of the Timer A prescaler in the 32-bit modes. This register is ununsed in 16-bit GPTM mode.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PSS</name>
              <description>[15:0] GPTM Timer A prescaler</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPS</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>GPTM Timer B prescale snapshot
For the 32-bit wide GPTM, this register shows the current value of the Timer B prescaler in the 32-bit modes. This register is ununsed in 16-bit GPTM mode.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PSS</name>
              <description>[15:0] GPTM Timer B prescaler</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TAPV</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>GPTM Timer A prescale value
For the 32-bit wide GPTM, this register shows the current free-running value of the Timer A prescaler in the 32-bit modes. Software can use this value in conjunction with the TAV register to determine the time elapsed between an interrupt and the ISR entry. This register is ununsed in 16- or 32-bit GPTM mode.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PSV</name>
              <description>[15:0] GPTM Timer A prescaler value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TBPV</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>GPTM Timer B prescale value
For the 32-bit wide GPTM, this register shows the current free-running value of the Timer B prescaler in the 32-bit modes. Software can use this value in conjunction with the TBV register to determine the time elapsed between an interrupt and the ISR entry. This register is ununsed in 16- or 32-bit GPTM mode.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:16] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PSV</name>
              <description>[15:0] GPTM Timer B prescaler value</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PP</name>
          <addressOffset>0xfc0</addressOffset>
          <size>32</size>
          <description>GPTM peripheral properties
The PP register provides information regarding the properties of the general-purpose Timer module.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:7] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>ALTCLK</name>
              <description>[6:6] Alternate clock source
0: Timer is not capable of using an alternate clock.
1: Timer is capable of using an alternate clock.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SYNCNT</name>
              <description>[5:5] Synchronized start
0: Timer is not capable of synchronizing the count value with other timers.
1: Timer is capable of synchronizing the count value with other timers.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CHAIN</name>
              <description>[4:4] Chain with other timers
0: Timer is not capable of chaining with previously numbered Timers.
1: Timer is capable of chaining with previously numbered timers.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SIZE</name>
              <description>[3:0] Timer size
0: Timer A and Timer B are 16 bits wide with 8-bit prescale.
1: Timer A and Timer B are 32 bits wide with 16-bit prescale.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
