thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFCORE_FFSM</name>
      <baseAddress>0x40088500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>SRCRESMASK0</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>Source address matching result
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCRESMASK0</name>
              <description>[7:0] Extended address matching
When there is a match on entry ext_n, bits 2n and 2n + 1 are set in SRCRESMASK.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCRESMASK1</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Source address matching result
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCRESMASK1</name>
              <description>[7:0] Short address matching
When there is a match on entry panid_n + short_n, bit n is set in SRCRESMASK.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCRESMASK2</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Source address matching result
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCRESMASK2</name>
              <description>[7:0] 24-bit mask that indicates source address match for each individual entry in the source address table</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCRESINDEX</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>Source address matching result
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCRESINDEX</name>
              <description>[7:0] The bit index of the least-significant entry (0-23 for short addresses or 0-11 for extended addresses) in SRCRESMASK, or 0x3F when there is no source match
On a match, bit 5 is 0 when the match is on a short address and 1 when it is on an extended address.
On a match, bit 6 is 1 when the conditions for automatic pending bit in acknowledgment have been met (see the description of SRCMATCH.AUTOPEND).
The bit does not indicate if the acknowledgment is actually transmitted, and does not consider the PENDING_OR register bit and the SACK/SACKPEND/SNACK strobes.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCEXTPENDEN0</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Source address matching control
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCEXTPENDEN0</name>
              <description>[7:0] 8 LSBs of the 24-bit mask that enables or disables automatic pending for each of the 12 extended addresses. Entry n is mapped to SRCEXTPENDEN[2n]. All SRCEXTPENDEN[2n + 1] bits are don't care.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCEXTPENDEN1</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>Source address matching control
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCEXTPENDEN1</name>
              <description>[7:0] 8 middle bits of the 24-bit mask that enables or disables automatic pending for each of the 12 extended addresses
Entry n is mapped to SRCEXTPENDEN[2n]. All SRCEXTPENDEN[2n + 1] bits are don't care.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCEXTPENDEN2</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>Source address matching control
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCEXTPENDEN2</name>
              <description>[7:0] 8 MSBs of the 24-bit mask that enables or disables automatic pending for each of the 12 extended addresses
Entry n is mapped to SRCEXTPENDEN[2n]. All SRCEXTPENDEN[2n + 1] bits are don't care.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCSHORTPENDEN0</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>Source address matching control
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCSHORTPENDEN0</name>
              <description>[7:0] 8 LSBs of the 24-bit mask that enables or disables automatic pending for each of the 24 short addresses</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCSHORTPENDEN1</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Source address matching control
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCSHORTPENDEN1</name>
              <description>[7:0] 8 middle bits of the 24-bit mask that enables or disables automatic pending for each of the 24 short addresses</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRCSHORTPENDEN2</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>Source address matching control
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SRCSHORTPENDEN2</name>
              <description>[7:0] 8 MSBs of the 24-bit mask that enables or disables automatic pending for each of the 24 short addresses</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR0</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR0</name>
              <description>[7:0] EXT_ADDR[7:0]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR1</name>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR1</name>
              <description>[7:0] EXT_ADDR[15:8]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR2</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR2</name>
              <description>[7:0] EXT_ADDR[23:16]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR3</name>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR3</name>
              <description>[7:0] EXT_ADDR[31:24]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR4</name>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR4</name>
              <description>[7:0] EXT_ADDR[39:32]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR5</name>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR5</name>
              <description>[7:0] EXT_ADDR[47:40]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR6</name>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR6</name>
              <description>[7:0] EXT_ADDR[55:48]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>EXT_ADDR7</name>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EXT_ADDR7</name>
              <description>[7:0] EXT_ADDR[63:56]
The IEEE extended address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAN_ID0</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAN_ID0</name>
              <description>[7:0] PAN_ID[7:0]
The PAN ID used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PAN_ID1</name>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAN_ID1</name>
              <description>[7:0] PAN_ID[15:8]
The PAN ID used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SHORT_ADDR0</name>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SHORT_ADDR0</name>
              <description>[7:0] SHORT_ADDR[7:0]
The short address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SHORT_ADDR1</name>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <description>Local address information
This register is stored in RAM; the reset value is undefined.</description>
          <fields>
            <field>
              <name>Reserved</name>
              <description>[31:8] Reserved. Always write 0.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SHORT_ADDR1</name>
              <description>[7:0] SHORT_ADDR[15:8]
The short address used during destination address filtering</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
