thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
        <register>
          <name>CSPPROG_20</name>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_21</name>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_22</name>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPPROG_23</name>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <description>CSP program</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSP_INSTR</name>
              <description>[7:0] Byte N of the CSP program memory</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPCTRL</name>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <description>CSP control bit</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:1] Reserved. Always read 0.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MCU_CTRL</name>
              <description>[0:0] CSP MCU control input</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPSTAT</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>CSP status register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CSP_RUNNING</name>
              <description>[5:5] 1: CSP is running.
0: CSP is idle.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CSP_PC</name>
              <description>[4:0] CSP program counter</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPX</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>CSP X data register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSPX</name>
              <description>[7:0] Used by CSP instructions WAITX, RANDXY, INCX, DECX,
and conditional instructions.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPY</name>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <description>CSP Y data register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSPY</name>
              <description>[7:0] Used by CSP instructions RANDXY, INCY, DECY, and conditional instructions.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPZ</name>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <description>CSP Z data register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSPZ</name>
              <description>[7:0] Used by CSP instructions INCZ, DECZ, and conditional instructions.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CSPT</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>CSP T data register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CSPT</name>
              <description>[7:0] Content is decremented each time the MAC Timer overflows while the CSP program is running. The SCP program stops when decremented to 0. Setting CSPT = 0xFF prevents the register from being decremented.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFC_OBS_CTRL0</name>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <description>RF observation mux control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFC_OBS_POL0</name>
              <description>[6:6] The signal chosen by RFC_OBS_MUX0 is XORed with this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RFC_OBS_MUX0</name>
              <description>[5:0] Controls which observable signal from RF Core is to be muxed out to rfc_obs_sigs[0].
00 0000: 0 - Constant value
00 0001: 1 - Constant value
00 1000: rfc_sniff_data - Data from packet sniffer. Sample data on rising edges of sniff_clk.
00 1001: rfc_sniff_clk - 250kHz clock for packet sniffer data.
00 1100: rssi_valid - Pin is high when the RSSI value has been updated at least once since RX was started. Cleared when leaving RX.
00 1101: demod_cca - Clear channel assessment. See FSMSTAT1 register for details on how to configure the behavior of this signal.
00 1110: sampled_cca - A sampled version of the CCA bit from demodulator. The value is updated whenever a SSAMPLECCA or STXONCCA strobe is issued.
00 1111: sfd_sync - Pin is high when a SFD has been received or transmitted. Cleared when leaving RX/TX respectively. Not to be confused with the SFD exception.
01 0000: tx_active - Indicates that FFCTRL is in one of the TX states. Active-high.
Note: This signal might have glitches, because it has no output flip-flop and is based
on the current state register of the FFCTRL FSM.
01 0001: rx_active - Indicates that FFCTRL is in one of the RX states. Active-high.
Note: This signal might have glitches, because it has no output flip-flop and is based
on the current state register of the FFCTRL FSM.
01 0010: ffctrl_fifo - Pin is high when one or more bytes are in the RXFIFO. Low during RXFIFO overflow.
01 0011: ffctrl_fifop - Pin is high when the number of bytes in the RXFIFO exceeds the programmable threshold or at least one complete frame is in the RXFIFO. Also high
during RXFIFO overflow. Not to be confused with the FIFOP exception.
01 0100: packet_done - A complete frame has been received. I.e., the number of bytes set by the frame-length field has been received.
01 0110: rfc_xor_rand_i_q - XOR between I and Q random outputs. Updated at 8 MHz.
01 0111: rfc_rand_q - Random data output from the Q channel of the receiver. Updated at 8 MHz.
01 1000: rfc_rand_i - Random data output from the I channel of the receiver. Updated at 8 MHz
01 1001: lock_status - 1 when PLL is in lock, otherwise 0
10 1000: pa_pd - Power amplifier power-down signal
10 1010: lna_pd - LNA power-down signal
Others: Reserved</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFC_OBS_CTRL1</name>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <description>RF observation mux control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFC_OBS_POL1</name>
              <description>[6:6] The signal chosen by RFC_OBS_MUX1 is XORed with this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RFC_OBS_MUX1</name>
              <description>[5:0] Controls which observable signal from RF Core is to be muxed out to rfc_obs_sigs[1].
See description of RFC_OBS_CTRL0 for details.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFC_OBS_CTRL2</name>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <description>RF observation mux control</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:7] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFC_OBS_POL2</name>
              <description>[6:6] The signal chosen by RFC_OBS_MUX2 is XORed with this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RFC_OBS_MUX2</name>
              <description>[5:0] Controls which observable signal from RF Core is to be muxed out to rfc_obs_sigs[2].
See description of RFC_OBS_CTRL0 for details.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>TXFILTCFG</name>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <description>TX filter configuration</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved. Always read 0.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>FC</name>
              <description>[3:0] Drives signal rfr_txfilt_fc</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
