thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
        <register>
          <name>RFIRQF0</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>RF interrupt flags</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RXMASKZERO</name>
              <description>[7:7] The RXENABLE register has gone from a nonzero state to an all-zero state.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RXPKTDONE</name>
              <description>[6:6] A complete frame has been received.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>FRAME_ACCEPTED</name>
              <description>[5:5] Frame has passed frame filtering.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SRC_MATCH_FOUND</name>
              <description>[4:4] Source match is found.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SRC_MATCH_DONE</name>
              <description>[3:3] Source matching is complete.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FIFOP</name>
              <description>[2:2] The number of bytes in the RX FIFO is greater than the threshold. Also raised when a complete frame is received, and when a packet is read out completely and more complete packets are available.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SFD</name>
              <description>[1:1] SFD has been received or transmitted.
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ACT_UNUSED</name>
              <description>[0:0] Reserved
0: No interrupt pending
1: Interrupt pending</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RFST</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>RF CSMA-CA/strobe processor</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>INSTR</name>
              <description>[7:0] Data written to this register is written to the CSP instruction memory. Reading this register returns the CSP instruction currently being executed.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <baseAddress>0x40089000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>ADDR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Function address</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>UPDATE</name>
              <description>[7:7] This bit is set by hardware when writing to this register, and is cleared by hardware when the new address becomes effective.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>USBADDR</name>
              <description>[6:0] Device address. 
The address shall be updated upon successful completion of the status stage of the SET_ADDRESS request.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>POW</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Power management and control register</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ISOWAITSOF</name>
              <description>[7:7] For isochronous mode IN endpoints:
When set,  the USB controller will wait for an SOF token from the time USB_CSIL.INPKTRDY is set before sending the packet. If an IN token is received before an SOF token, then a zero length data
packet will be sent.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>Reserved7</name>
              <description>[6:4] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RST</name>
              <description>[3:3] Indicates that reset signaling is present on the bus</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RESUME</name>
              <description>[2:2] Drives resume signaling for remote wakeup
According to the USB Specification, the resume signal must be held active for at least 1 ms and no more than 15 ms. It is recommended to keep this bit set for approximately 10 ms.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>[1:1] Indicates entry into suspend mode
Suspend mode must be enabled by setting USB_POW.SUSPENDEN
Software clears this bit by reading the USB_CIF register or by asserting USB_POW.RESUME</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SUSPENDEN</name>
              <description>[0:0] Enables detection of and entry into suspend mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IIF</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Interrupt flags for endpoint 0 and IN endpoints 1-5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>INEP5IF</name>
              <description>[5:5] Interrupt flag for IN endpoint 5
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INEP4IF</name>
              <description>[4:4] Interrupt flag for IN endpoint 4
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>INEP3IF</name>
              <description>[3:3] Interrupt flag for IN endpoint 3
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>INEP2IF</name>
              <description>[2:2] Interrupt flag for IN endpoint 2
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>INEP1IF</name>
              <description>[1:1] Interrupt flag for IN endpoint 1
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EP0IF</name>
              <description>[0:0] Interrupt flag for endpoint 0
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OIF</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Interrupt flags for OUT endpoints 1-5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>OUTEP5IF</name>
              <description>[5:5] Interrupt flag for OUT endpoint 5
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>OUTEP4IF</name>
              <description>[4:4] Interrupt flag for OUT endpoint 4
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>OUTEP3IF</name>
              <description>[3:3] Interrupt flag for OUT endpoint 3
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>OUTEP2IF</name>
              <description>[2:2] Interrupt flag for OUT endpoint 2
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>OUTEP1IF</name>
              <description>[1:1] Interrupt flag for OUT endpoint 1
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[0:0] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CIF</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Common USB interrupt flags</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SOFIF</name>
              <description>[3:3] Start-of-frame interrupt flag
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RSTIF</name>
              <description>[2:2] Reset interrupt flag
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESUMEIF</name>
              <description>[1:1] Resume interrupt flag
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SUSPENDIF</name>
              <description>[0:0] Suspend interrupt flag
Cleared by hardware when read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>IIE</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Interrupt enable mask for IN endpoints 1-5 and endpoint 0</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>INEP5IE</name>
              <description>[5:5] Interrupt enable for IN endpoint 5
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INEP4IE</name>
              <description>[4:4] Interrupt enable for IN endpoint 4
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>INEP3IE</name>
              <description>[3:3] Interrupt enable for IN endpoint 3
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>INEP2IE</name>
              <description>[2:2] Interrupt enable for IN endpoint 2
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>INEP1IE</name>
              <description>[1:1] Interrupt enable for IN endpoint 1
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EP0IE</name>
              <description>[0:0] Interrupt enable for endpoint 0
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>OIE</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Interrupt enable mask for OUT endpoints 1-5</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>reserved8</name>
              <description>[7:6] Reserved</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>OUTEP5IE</name>
              <description>[5:5] Interrupt enable for OUT endpoint 5
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>OUTEP4IE</name>
              <description>[4:4] Interrupt enable for OUT endpoint 4
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>OUTEP3IE</name>
              <description>[3:3] Interrupt enable for OUT endpoint 3
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>OUTEP2IE</name>
              <description>[2:2] Interrupt enable for OUT endpoint 2
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>OUTEP1IE</name>
              <description>[1:1] Interrupt enable for OUT endpoint 1
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>Reserved1</name>
              <description>[0:0] Reserved</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CIE</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Common USB interrupt enable mask</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SOFIE</name>
              <description>[3:3] Start-of-frame interrupt enable
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RSTIE</name>
              <description>[2:2] Reset interrupt enable
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESUMEIE</name>
              <description>[1:1] Resume interrupt enable
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SUSPENDIE</name>
              <description>[0:0] Suspend interrupt enable
0: Interrupt disabled
1: Interrupt enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FRML</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Frame number (low byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>FRAMEL</name>
              <description>[7:0] Bits 7:0 of the 11-bit frame number
The frame number is only updated upon successful reception of SOF tokens</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>FRMH</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Frame number (high byte)</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:3] Reserved</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FRAMEH</name>
              <description>[2:0] Bits 10:8 of the 11-bit frame number
The frame number is only updated upon successful reception of SOF tokens</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>INDEX</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Index register for selecting the endpoint status and control registers</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:8] Reserved</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:4] Reserved</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>USBINDEX</name>
              <description>[3:0] Index of the currently selected endpoint
The index is set to 0 to enable access to endpoint 0 control and status registers
The index is set to 1, 2, 3, 4 or 5 to enable access to IN/OUT endpoint 1, 2, 3, 4 or 5 control and status registers, respectively</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
