thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the new_hash bit in the HASH_MODE register is 0 when starting a hash session).

New hash:
When initiating a new hash session (the new_hash bit in the HASH_MODE register is high), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH_DIGEST_D</name>
          <addressOffset>0x65c</addressOffset>
          <size>32</size>
          <description>Hash digest registers
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[127:96]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the new_hash bit in the HASH_MODE register is 0 when starting a hash session).

New hash:
When initiating a new hash session (the new_hash bit in the HASH_MODE register is high), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH_DIGEST_E</name>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <description>Hash digest registers
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[159:128]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the new_hash bit in the HASH_MODE register is 0 when starting a hash session).

New hash:
When initiating a new hash session (the new_hash bit in the HASH_MODE register is high), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH_DIGEST_F</name>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <description>Hash digest registers
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[191:160]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the new_hash bit in the HASH_MODE register is 0 when starting a hash session).

New hash:
When initiating a new hash session (the new_hash bit in the HASH_MODE register is high), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH_DIGEST_G</name>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <description>Hash digest registers
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[223:192]
Hash digest registers
Write operation:

Continued hash:
These registers should be written with the context data, before the start of a resumed hash session (the new_hash bit in the HASH_MODE register is 0 when starting a hash session).

New hash:
When initiating a new hash session (the new_hash bit in the HASH_MODE register is high), the internal digest registers are automatically set to the SHA-256 algorithm constant and these register should not be written.

Reading from these registers provides the intermediate hash result (non-final hash operation) or the final hash result (final hash operation) after data processing.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>HASH_DIGEST_H</name>
          <addressOffset>0x66c</addressOffset>
          <size>32</size>
          <description>Hash digest registers
The hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>[31:0] HASH_DIGEST[255:224]
Hash digest registers
Write operation:

