thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS_CTRL</name>
      <baseAddress>0x400D2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Register fields should be considered static unless otherwise noted as dynamic.</description>
      <registers>
        <register>
          <name>CLOCK_CTRL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>The clock control register handels clock settings in the CC2538. The settings in CLOCK_CTRL do not always reflect the current chip status which is found in CLOCK_STA register.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:26] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>OSC32K_CALDIS</name>
              <description>[25:25] Disable calibration 32-kHz RC oscillator.
0: Enable calibration
1: Disable calibration</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>OSC32K</name>
              <description>[24:24] 32-kHz clock oscillator selection
0: 32-kHz crystal oscillator
1: 32-kHz RC oscillator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>Reserved24</name>
              <description>[23:22] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>AMP_DET</name>
              <description>[21:21] Amplitude detector of XOSC during power up
0: No action
1: Delay qualification of XOSC until amplitude is greater than the threshold.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>Reserved21</name>
              <description>[20:18] Reserved. Always read 0.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>OSC_PD</name>
              <description>[17:17] 0: Power up both oscillators 
1: Power down oscillator not selected by OSC bit (hardware-controlled when selected).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>OSC</name>
              <description>[16:16] System clock oscillator selection
0: 32-MHz crystal oscillator
1: 16-MHz HF-RC oscillator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:11] Reserved. Always read 0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>IO_DIV</name>
              <description>[10:8] I/O clock rate setting
Cannot be higher than OSC setting
000: 32 MHz
001: 16 MHz
010: 8 MHz
011: 4 MHz
100: 2 MHz
101: 1 MHz
110: 0.5 MHz
111: 0.25 MHz</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:6] Reserved. Always read 0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>Reserved5</name>
              <description>[5:5] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[4:3] Software should not rely on the value of a reserved bit. To provide compatibility with future products, the value of a reserved bit should be preserved across a read-modify-write operation.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SYS_DIV</name>
              <description>[2:0] System clock rate setting
Cannot be higher than OSC setting
000: 32 MHz
001: 16 MHz
010: 8 MHz
011: 4 MHz
100: 2 MHz
101: 1 MHz
110: 0.5 MHz
111: 0.25 MHz</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLOCK_STA</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Clock status register
This register reflects the current chip status.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:27] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>SYNC_32K</name>
              <description>[26:26] 32-kHz clock source synced to undivided system clock (16 or 32 MHz).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>OSC32K_CALDIS</name>
              <description>[25:25] Disable calibration 32-kHz RC oscillator.
0: Calibration enabled
1: Calibration disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>OSC32K</name>
              <description>[24:24] Current 32-kHz clock oscillator selected.
0: 32-kHz crystal oscillator
1: 32-kHz RC oscillator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RST</name>
              <description>[23:22] Returns last source of reset
00: POR
01: External reset
10: WDT
11: CLD or software reset</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>Reserved22</name>
              <description>[21:21] Reserved. Always read 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>SOURCE_CHANGE</name>
              <description>[20:20] 0: System clock is not requested to change.
1: A change of system clock source has been initiated and is not finished. Same as when OSC bit in CLOCK_STA and CLOCK_CTRL register are not equal</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>XOSC_STB</name>
              <description>[19:19] XOSC stable status
0: XOSC is not powered up or not yet stable.
1: XOSC is powered up and stable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>HSOSC_STB</name>
              <description>[18:18] HSOSC stable status
0: HSOSC is not powered up or not yet stable.
1: HSOSC is powered up and stable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>OSC_PD</name>
              <description>[17:17] 0: Both oscillators powered up and stable and OSC_PD_CMD = 0.
1: Oscillator not selected by CLOCK_CTRL.OSC bit is powered down.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>OSC</name>
              <description>[16:16] Current clock source selected
0: 32-MHz crystal oscillator
1: 16-MHz HF-RC oscillator</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>Reserved16</name>
              <description>[15:11] Reserved. Always read 0.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>IO_DIV</name>
              <description>[10:8] Returns current functional frequency for IO_CLK
(may differ from setting in the CLOCK_CTRL register)
000: 32 MHz
001: 16 MHz
010: 8 MHz
011: 4 MHz
100: 2 MHz
101: 1 MHz
110: 0.5 MHz
111: 0.25 MHz</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>Reserved8</name>
              <description>[7:5] Reserved. Always read 0.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RTCLK_FREQ</name>
              <description>[4:3] Returns current functional frequency for real-time clock. 
(may differ from setting in the CLOCK_CTRL register)
1x : 8 MHz
01: 2 MHz
00: 62.5 kHz</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SYS_DIV</name>
              <description>[2:0] Returns current functional frequency for system clock 
(may differ from setting in the CLOCK_CTRL register)
000: 32 MHz
001: 16 MHz
010: 8 MHz
011: 4 MHz
100: 2 MHz
101: 1 MHz
110: 0.5 MHz
111: 0.25 MHz</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RCGCGPT</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for GPT[3:0] when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>GPT3</name>
              <description>[3:3] 0: Clock for GPT3 is gated.
1: Clock for GPT3 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>GPT2</name>
              <description>[2:2] 0: Clock for GPT2 is gated.
1: Clock for GPT2 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>GPT1</name>
              <description>[1:1] 0: Clock for GPT1 is gated.
1: Clock for GPT1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>GPT0</name>
              <description>[0:0] 0: Clock for GPT0 is gated.
1: Clock for GPT0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCGCGPT</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for GPT[3:0] when the CPU is in sleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>GPT3</name>
              <description>[3:3] 0: Clock for GPT3 is gated.
1: Clock for GPT3 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>GPT2</name>
              <description>[2:2] 0: Clock for GPT2 is gated.
1: Clock for GPT2 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>GPT1</name>
              <description>[1:1] 0: Clock for GPT1 is gated.
1: Clock for GPT1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>GPT0</name>
              <description>[0:0] 0: Clock for GPT0 is gated.
1: Clock for GPT0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DCGCGPT</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for GPT[3:0] when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>GPT3</name>
              <description>[3:3] 0: Clock for GPT3 is gated.
1: Clock for GPT3 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>GPT2</name>
              <description>[2:2] 0: Clock for GPT2 is gated.
1: Clock for GPT2 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>GPT1</name>
              <description>[1:1] 0: Clock for GPT1 is gated.
1: Clock for GPT1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>GPT0</name>
              <description>[0:0] 0: Clock for GPT0 is gated.
1: Clock for GPT0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRGPT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>This register controls the reset for GPT[3:0].</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>GPT3</name>
              <description>[3:3] 0: GPT3 module is not reset
1: GPT3 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>GPT2</name>
              <description>[2:2] 0: GPT2 module is not reset
1: GPT2 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>GPT1</name>
              <description>[1:1] 0: GPT1 module is not reset
1: GPT1 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>GPT0</name>
              <description>[0:0] 0: GPT0 module is not reset
1: GPT0 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RCGCSSI</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for SSI[1:0] when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SSI1</name>
              <description>[1:1] 0: Clock for SSI1 is gated.
1: Clock for SSI1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SSI0</name>
              <description>[0:0] 0: Clock for SSI0 is gated.
1: Clock for SSI0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCGCSSI</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for SSI[1:0] when the CPU is insSleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SSI1</name>
              <description>[1:1] 0: Clock for SSI1 is gated.
1: Clock for SSI1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SSI0</name>
              <description>[0:0] 0: Clock for SSI0 is gated.
1: Clock for SSI0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>DCGCSSI</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for SSI[1:0] when the CPU is in PM0. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SSI1</name>
              <description>[1:1] 0: Clock for SSI1 is gated.
1: Clock for SSI1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SSI0</name>
              <description>[0:0] 0: Clock for SSI0 is gated.
1: Clock for SSI0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SRSSI</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>This register controls the reset for SSI[1:0].</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SSI1</name>
              <description>[1:1] 0: SSI1 module is not reset
1: SSI1 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SSI0</name>
              <description>[0:0] 0: SSI0 module is not reset
1: SSI0 module is reset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>RCGCUART</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for UART[1:0] when the CPU is in active (run) mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UART1</name>
              <description>[1:1] 0: Clock for UART1 is gated.
1: Clock for UART1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UART0</name>
              <description>[0:0] 0: Clock for UART0 is gated.
1: Clock for UART0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SCGCUART</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>This register defines the module clocks for UART[1:0] when the CPU is in sleep mode. This register setting is don't care for PM1-3, because the system clock is powered down in these modes.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:2] This register is 8 bits in a 32-bit address space.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UART1</name>
              <description>[1:1] 0: Clock for UART1 is gated.
1: Clock for UART1 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UART0</name>
              <description>[0:0] 0: Clock for UART0 is gated.
1: Clock for UART0 is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
