thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
        <register>
          <name>PD7_SEL</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>Peripheral select control for PD7</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PD7_sel</name>
              <description>[4:0] Select one peripheral signal output for PD7.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA0_OVER</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA0_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA1_OVER</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA1_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA2_OVER</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA2_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA3_OVER</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA3_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA4_OVER</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA4_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA5_OVER</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA5_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA6_OVER</name>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA6_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PA7_OVER</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PA7_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB0_OVER</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB0_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB1_OVER</name>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB1_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB2_OVER</name>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB2_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB3_OVER</name>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB3_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB4_OVER</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB4_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB5_OVER</name>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB5_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB6_OVER</name>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB6_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PB7_OVER</name>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PB7_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC0_OVER</name>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad. PC0 has high drive capability.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC0_over</name>
              <description>[3:3] 0: output disable
1: oe - output enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:0] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC1_OVER</name>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad. PC1 has high drive capability.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC1_over</name>
              <description>[3:3] 0: output disable
1: oe - output enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:0] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC2_OVER</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad. PC2 has high drive capability.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC2_over</name>
              <description>[3:3] 0: output disable
1: oe - output enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:0] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC3_OVER</name>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad. PC3 has high drive capability.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC3_over</name>
              <description>[3:3] 0: output disable
1: oe - output enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>Reserved3</name>
              <description>[2:0] Reserved</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC4_OVER</name>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC4_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC5_OVER</name>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC5_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC6_OVER</name>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC6_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PC7_OVER</name>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PC7_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD0_OVER</name>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD0_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD1_OVER</name>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD1_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD2_OVER</name>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD2_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
