thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
        <register>
          <name>PD3_OVER</name>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD3_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD4_OVER</name>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD4_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD5_OVER</name>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD5_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD6_OVER</name>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD6_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PD7_OVER</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>This is the overide configuration register for each pad.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:4] Reserved</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PD7_over</name>
              <description>[3:0] 0x8: oe - output enable
0x4: pue - pullup enable
0x2: pde - pulldown enable
0x1: ana - analog enable</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UARTRXD_UART0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the UART0 RX.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as UART0 RX
1: PA1 selected as UART0 RX
...
31: PD7 selected as UART0 RX</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UARTCTS_UART1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the UART1 CTS.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as UART1 CTS
1: PA1 selected as UART1 CTS
...
31: PD7 selected as UART1 CTS</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>UARTRXD_UART1</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the UART1 RX.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as UART1 RX
1: PA1 selected as UART1 RX
...
31: PD7 selected as UART1 RX</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLK_SSI_SSI0</name>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI0 CLK.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI0 CLK
1: PA1 selected as SSI0 CLK
...
31: PD7 selected as SSI0 CLK</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSIRXD_SSI0</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI0 RX.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI0 RX
1: PA1 selected as SSI0 RX
...
31: PD7 selected as SSI0 RX</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSIFSSIN_SSI0</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI0 FSSIN.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI0 FSSIN
1: PA1 selected as SSI0 FSSIN
...
31: PD7 selected as SSI0 FSSIN</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLK_SSIIN_SSI0</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI0 CLK_SSIN.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI0 CLK_SSIN
1: PA1 selected as SSI0 CLK_SSIN
...
31: PD7 selected as SSI0 CLK_SSIN</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLK_SSI_SSI1</name>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI1 CLK.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI1 CLK
1: PA1 selected as SSI1 CLK
...
31: PD7 selected as SSI1 CLK</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSIRXD_SSI1</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI1 RX.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI1 RX
1: PA1 selected as SSI1 RX
...
31: PD7 selected as SSI1 RX</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>SSIFSSIN_SSI1</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI1 FSSIN.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI1 FSSIN
1: PA1 selected as SSI1 FSSIN
...
31: PD7 selected as SSI1 FSSIN</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>CLK_SSIIN_SSI1</name>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the SSI1 CLK_SSIN.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as SSI1 CLK_SSIN
1: PA1 selected as SSI1 CLK_SSIN
...
31: PD7 selected as SSI1 CLK_SSIN</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>I2CMSSDA</name>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the I2C SDA.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as I2C SDA
1: PA1 selected as I2C SDA
...
31: PD7 selected as I2C SDA</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>I2CMSSCL</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the I2C SCL.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as I2C SCL
1: PA1 selected as I2C SCL
...
31: PD7 selected as I2C SCL</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT0OCP1</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT0OCP1.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT0OCP1
1: PA1 selected as GPT0OCP1
...
31: PD7 selected as GPT0OCP1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT0OCP2</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT0OCP2.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT0OCP2
1: PA1 selected as GPT0OCP2
...
31: PD7 selected as GPT0OCP2</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT1OCP1</name>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT1OCP1.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT1OCP1
1: PA1 selected as GPT1OCP1
...
31: PD7 selected as GPT1OCP1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT1OCP2</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT1OCP2.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT1OCP2
1: PA1 selected as GPT1OCP2
...
31: PD7 selected as GPT1OCP2</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT2OCP1</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT2OCP1.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT2OCP1
1: PA1 selected as GPT2OCP1
...
31: PD7 selected as GPT2OCP1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT2OCP2</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT2OCP2.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT2OCP2
1: PA1 selected as GPT2OCP2
...
31: PD7 selected as GPT2OCP2</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT3OCP1</name>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT3OCP1.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT3OCP1
1: PA1 selected as GPT3OCP1
...
31: PD7 selected as GPT3OCP1</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>GPT3OCP2</name>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <description>Selects one of the 32 pins on the four 8-pin I/O-ports (port A, port B, port C, and port D) to be the GPT3OCP2.</description>
          <fields>
            <field>
              <name>Reserved32</name>
              <description>[31:5] Reserved</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>INPUT_SEL</name>
              <description>[4:0] 0: PA0 selected as GPT3OCP2
1: PA1 selected as GPT3OCP2
...
31: PD7 selected as GPT3OCP2</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
