thibautvdv/drone-ti-sl-map/svd_files/cc2538nf53.svd
In priority order for PB[1]:
When POR/BOD test mode is active, PB[1] becomes the active low brown-out detected indicator.
When DCEN is set and DCPIN is not set, PB[1] becomes the on-dir digital regulator status.

In priority order for PB[0]:
When POR/BOD test mode is active, PB[0] becomes the power-on-reset indicator.
When DCEN and DCPIN are set, PB[0] becomes the on-die digital regulator status.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>P_EDGE_CTRL</name>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <description>The port edge control register is used to control which edge of each port input causes that port to generate a power-up interrupt to the system.</description>
          <fields>
            <field>
              <name>PDIRC7</name>
              <description>[31:31] Port D bit 7 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>PDIRC6</name>
              <description>[30:30] Port D bit 6 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>PDIRC5</name>
              <description>[29:29] Port D bit 5 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>PDIRC4</name>
              <description>[28:28] Port D bit 4 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>PDIRC3</name>
              <description>[27:27] Port D bit 3 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>PDIRC2</name>
              <description>[26:26] Port D bit 2 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>PDIRC1</name>
              <description>[25:25] Port D bit 1 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>PDIRC0</name>
              <description>[24:24] Port D bit 0 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PCIRC7</name>
              <description>[23:23] Port C bit 7 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>PCIRC6</name>
              <description>[22:22] Port C bit 6 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>PCIRC5</name>
              <description>[21:21] Port C bit 5 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>PCIRC4</name>
              <description>[20:20] Port C bit 4 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>PCIRC3</name>
              <description>[19:19] Port C bit 3 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>PCIRC2</name>
              <description>[18:18] Port C bit 2 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>PCIRC1</name>
              <description>[17:17] Port C bit 1 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>PCIRC0</name>
              <description>[16:16] Port C bit 0 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PBIRC7</name>
              <description>[15:15] Port B bit 7 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>PBIRC6</name>
              <description>[14:14] Port B bit 6 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBIRC5</name>
              <description>[13:13] Port B bit 5 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBIRC4</name>
              <description>[12:12] Port B bit 4 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBIRC3</name>
              <description>[11:11] Port B bit 3 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBIRC2</name>
              <description>[10:10] Port B bit 2 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBIRC1</name>
              <description>[9:9] Port B bit 1 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBIRC0</name>
              <description>[8:8] Port B bit 0 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAIRC7</name>
              <description>[7:7] Port A bit 7 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAIRC6</name>
              <description>[6:6] Port A bit 6 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAIRC5</name>
              <description>[5:5] Port A bit 5 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAIRC4</name>
              <description>[4:4] Port A bit 4 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAIRC3</name>
              <description>[3:3] Port A bit 3 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAIRC2</name>
              <description>[2:2] Port A bit 2 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAIRC1</name>
              <description>[1:1] Port A bit 1 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAIRC0</name>
              <description>[0:0] Port A bit 0 interrupt request condition:
0: Rising
1: Falling edge</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>USB_CTRL</name>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <description>This register is used to control which edge of the USB controller input generates a power-up interrupt to the system.</description>
          <fields>
            <field>
              <name>Reserved31</name>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>USB_EDGE_CTL</name>
              <description>[0:0] Used to set the edge which triggers the USB power up interrupt
0: Rising
1: Falling</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>PI_IEN</name>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <description>The power-up interrupt enable register selects, for its corresponding port A-D pin, whether interrupts are enabled or disabled.</description>
          <fields>
            <field>
              <name>PDIEN7</name>
              <description>[31:31] Port D bit 7 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>PDIEN6</name>
              <description>[30:30] Port D bit 6 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>PDIEN5</name>
              <description>[29:29] Port D bit 5 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>PDIEN4</name>
              <description>[28:28] Port D bit 4 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>PDIEN3</name>
              <description>[27:27] Port D bit 3 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>PDIEN2</name>
              <description>[26:26] Port D bit 2 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>PDIEN1</name>
              <description>[25:25] Port D bit 1 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>PDIEN0</name>
              <description>[24:24] Port D bit 0 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PCIEN7</name>
              <description>[23:23] Port C bit 7 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>PCIEN6</name>
              <description>[22:22] Port C bit 6 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>PCIEN5</name>
              <description>[21:21] Port C bit 5 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>PCIEN4</name>
              <description>[20:20] Port C bit 4 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>PCIEN3</name>
              <description>[19:19] Port C bit 3 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>PCIEN2</name>
              <description>[18:18] Port C bit 2 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>PCIEN1</name>
              <description>[17:17] Port C bit 1 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>PCIEN0</name>
              <description>[16:16] Port C bit 0 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PBIEN7</name>
              <description>[15:15] Port B bit 7 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>PBIEN6</name>
              <description>[14:14] Port B bit 6 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>PBIEN5</name>
              <description>[13:13] Port B bit 5 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PBIEN4</name>
              <description>[12:12] Port B bit 4 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>PBIEN3</name>
              <description>[11:11] Port B bit 3 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>PBIEN2</name>
              <description>[10:10] Port B bit 2 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PBIEN1</name>
              <description>[9:9] Port B bit 1 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PBIEN0</name>
              <description>[8:8] Port B bit 0 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PAIEN7</name>
              <description>[7:7] Port A bit 7 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>PAIEN6</name>
              <description>[6:6] Port A bit 6 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>PAIEN5</name>
              <description>[5:5] Port A bit 5 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>PAIEN4</name>
              <description>[4:4] Port A bit 4 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PAIEN3</name>
              <description>[3:3] Port A bit 3 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PAIEN2</name>
              <description>[2:2] Port A bit 2 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PAIEN1</name>
              <description>[1:1] Port A bit 1 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PAIEN0</name>
              <description>[0:0] Port A bit 0 interrupt enable:
1: Enabled
2: Disabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0</resetValue>
        </register>
